# Selecting data with .query()

In [23]:
import pandas as pd

stocks = pd.DataFrame({
    "date": ["2019-07-01", "2019-08-01", "2019-09-01", "2019-10-01", "2019-11-01", "2019-12-01", "2020-01-01", "2020-02-01", "2020-03-01", "2020-04-01"],
    "disney": [143.009995, 137.259995, 130.320007, 129.919998, 151.580002, 144.630005, 138.309998, 117.650002, 96.599998, 99.580002],
    "nike": [86.029999, 84.5, 93.919998, 89.550003, 93.489998, 101.309998, 96.300003, 89.379997, 82.739998, 84.629997]
})

print(stocks)

         date      disney        nike
0  2019-07-01  143.009995   86.029999
1  2019-08-01  137.259995   84.500000
2  2019-09-01  130.320007   93.919998
3  2019-10-01  129.919998   89.550003
4  2019-11-01  151.580002   93.489998
5  2019-12-01  144.630005  101.309998
6  2020-01-01  138.309998   96.300003
7  2020-02-01  117.650002   89.379997
8  2020-03-01   96.599998   82.739998
9  2020-04-01   99.580002   84.629997

## Querying on single condition

In [24]:
stocks.query('nike >= 90')

         date      disney        nike
2  2019-09-01  130.320007   93.919998
4  2019-11-01  151.580002   93.489998
5  2019-12-01  144.630005  101.309998
6  2020-01-01  138.309998   96.300003

In [25]:
print(stocks.query('disney < 100'))

         date     disney       nike
8  2020-03-01  96.599998  82.739998
9  2020-04-01  99.580002  84.629997

## Querrying on multiple conditions, "and", "or"

In [26]:
print(stocks.query('nike > 90 and disney < 140'))

         date      disney       nike
2  2019-09-01  130.320007  93.919998
6  2020-01-01  138.309998  96.300003

In [27]:
print(stocks.query("nike > 90 and disney > 100"))

         date      disney        nike
2  2019-09-01  130.320007   93.919998
4  2019-11-01  151.580002   93.489998
5  2019-12-01  144.630005  101.309998
6  2020-01-01  138.309998   96.300003

In [28]:
print(stocks.query('nike > 90 or disney > 100'))

         date      disney        nike
0  2019-07-01  143.009995   86.029999
1  2019-08-01  137.259995   84.500000
2  2019-09-01  130.320007   93.919998
3  2019-10-01  129.919998   89.550003
4  2019-11-01  151.580002   93.489998
5  2019-12-01  144.630005  101.309998
6  2020-01-01  138.309998   96.300003
7  2020-02-01  117.650002   89.379997

In [29]:
import pandas as pd

stocks_long = pd.DataFrame({
    "date": ["2019-07-01", "2019-08-01", "2019-09-01", "2019-10-01", "2019-11-01", "2019-12-01", "2020-01-01", "2020-02-01", "2020-03-01", "2020-04-01"],
    "stock": ["disney", "disney", "disney", "disney", "disney", "nike", "nike", "nike", "nike", "nike"],
    "close": [143.009995, 137.259995, 130.320007, 129.919998, 151.580002, 144.630005, 138.309998, 117.650002, 96.599998, 99.580002],
    
})

print(stocks_long)

         date   stock       close
0  2019-07-01  disney  143.009995
1  2019-08-01  disney  137.259995
2  2019-09-01  disney  130.320007
3  2019-10-01  disney  129.919998
4  2019-11-01  disney  151.580002
5  2019-12-01    nike  144.630005
6  2020-01-01    nike  138.309998
7  2020-02-01    nike  117.650002
8  2020-03-01    nike   96.599998
9  2020-04-01    nike   99.580002

## Using .query() to select text

In [30]:
stocks_long.query('stock =="disney" or (stock=="nike" and close > 90)')

         date   stock       close
0  2019-07-01  disney  143.009995
1  2019-08-01  disney  137.259995
2  2019-09-01  disney  130.320007
3  2019-10-01  disney  129.919998
4  2019-11-01  disney  151.580002
5  2019-12-01    nike  144.630005
6  2020-01-01    nike  138.309998
7  2020-02-01    nike  117.650002
8  2020-03-01    nike   96.599998
9  2020-04-01    nike   99.580002

# Reshaping data with .melt()

In [31]:
import pandas as pd

social_fin =pd.DataFrame({
    "financial" : ["total_revenue", "gross_profit", "net_income", "total_revenue", "gross_profit", "net_income"],
    "company": ["twitter", "twitter", "twitter", "facebook", "facebook", "facebook"],
    "2019":[3459329, 2322288, 1465659, 70697000, 57927000, 18485000],
    "2018": [3042359, 207762, 1205596, 55838000, 46483000, 22112000],
    "2017": [2443299, 1582057, -108063, 40653000, 35199000, 15934000],
    "2016": [2529619, 1597379, -456873, 27638000, 23849000, 10217000]
})

print(social_fin.head())

       financial   company      2019      2018      2017      2016
0  total_revenue   twitter   3459329   3042359   2443299   2529619
1   gross_profit   twitter   2322288    207762   1582057   1597379
2     net_income   twitter   1465659   1205596   -108063   -456873
3  total_revenue  facebook  70697000  55838000  40653000  27638000
4   gross_profit  facebook  57927000  46483000  35199000  23849000

**This *social_fin* dataset is an example of wide format dataset.**

## Example of .melt()

In [32]:
social_fin_tall = social_fin.melt(id_vars=['financial', 'company'])
print(social_fin_tall)

        financial   company variable     value
0   total_revenue   twitter     2019   3459329
1    gross_profit   twitter     2019   2322288
2      net_income   twitter     2019   1465659
3   total_revenue  facebook     2019  70697000
4    gross_profit  facebook     2019  57927000
5      net_income  facebook     2019  18485000
6   total_revenue   twitter     2018   3042359
7    gross_profit   twitter     2018    207762
8      net_income   twitter     2018   1205596
9   total_revenue  facebook     2018  55838000
10   gross_profit  facebook     2018  46483000
11     net_income  facebook     2018  22112000
12  total_revenue   twitter     2017   2443299
13   gross_profit   twitter     2017   1582057
14     net_income   twitter     2017   -108063
15  total_revenue  facebook     2017  40653000
16   gross_profit  facebook     2017  35199000
17     net_income  facebook     2017  15934000
18  total_revenue   twitter     2016   2529619
19   gross_profit   twitter     2016   1597379
20     net_income   twitter     2016   -456873
21  total_revenue  facebook     2016  27638000
22   gross_profit  facebook     2016  23849000
23     net_income  facebook     2016  10217000

**This is an example of long format, and computer finds it more accessible**

## Melting with value_vars

In [33]:
social_fin_tall = social_fin.melt(id_vars=["financial", "company"], value_vars=["2018", "2017"])
print(social_fin_tall.head(10))

       financial   company variable     value
0  total_revenue   twitter     2018   3042359
1   gross_profit   twitter     2018    207762
2     net_income   twitter     2018   1205596
3  total_revenue  facebook     2018  55838000
4   gross_profit  facebook     2018  46483000
5     net_income  facebook     2018  22112000
6  total_revenue   twitter     2017   2443299
7   gross_profit   twitter     2017   1582057
8     net_income   twitter     2017   -108063
9  total_revenue  facebook     2017  40653000

## Melting with column names

In [34]:
social_fin_tall = social_fin.melt(id_vars=['financial', 'company'], value_vars=["2018", "2017"],
                                  var_name='year', value_name= '$ dollars')

print(social_fin_tall.head())

       financial   company  year  $ dollars
0  total_revenue   twitter  2018    3042359
1   gross_profit   twitter  2018     207762
2     net_income   twitter  2018    1205596
3  total_revenue  facebook  2018   55838000
4   gross_profit  facebook  2018   46483000